// Базовый
// 1. Написать ответ - почему массивы в JS являются "неправильными" и совмещают в себе несколько
// структур данных? Какие ?
//
//   Массивы в JS называют не правильными, потому что они имеют методы, свойства и поведение,
// которые отличаются от методов и свойств типичных массивов в других языках программирования.
//   Фактически массивы в JS - это объекты, они имеют внутреннюю структуру, основанную на паре
// ключ-значение, где ключ — это индекс элемента, а значение — сам элемент массива. Массивы в JS
// не ограничены хранением элементов одного типа.
//   Массивы в JS совмещают в себе несколько структур данных, таких как списки, стэки, очереди,
// ассоциативные массивы (хэш таблицы) и объекты.
